pascal-4.0/tutorialsOld/surfaceTracking/interTrackMHDFoam/tank3D/0/fluidIndicator
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      fluidIndicator;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    trackedSurface
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    side-1
    {
        type            zeroGradient;
    }
    side-2
    {
        type            zeroGradient;
    }
    symm-1
    {
        type            symmetryPlane;
    }
    symm-2
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
